function MainPage(){

    //-----------------------------Канвас----------------------------------
    var canvas;
    var canvasContext;

    var canvasPos_X;
    var canvasPos_Y;
    var canvasWidth;
    var canvasHeigth;
    var canvasScale;
    //-----------------------------------------------------------------------
    //------------------------Массивы данных--------------------------------

    var cardsInDeck = [];                 //id дек и id карт
    var allPlayerCards = [];              //Все пользовательские карты
    var allPlayerDecks = [];             //Все пользовательские деки
    var transitionArrows = [];           //Стрелки навигации
    var loadedCards = [];
    var loadedDecks = [];
    var navigationBar;
    //-----------------------------------------------------------------------




    //-----------------------------Отрисовка-----------------------------------



    //-----------------------------------------------------------------------
}